src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИндивидуальныеПредприниматели</name>
      <description>Индивидуальные предприниматели</description>
    </items>
    <items>
      <name>Иностранные</name>
      <description>Иностранные</description>
    </items>
    <items>
      <name>Российские</name>
      <description>Российские</description>
    </items>
    <items>
      <name>ФизическиеЛица</name>
      <description>Физические лица</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидОрганизации</name>
    <type>
      <types>EnumRef.ВидыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЛиквидации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииМРП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Деятельность</name>
    <comment>Явл. комментарием по фирме</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеятельностьПрекращена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДатаВыдачи</name>
    <comment>Дата выдачи документа, удостоверяющего личность (для контрагентов - физических лиц)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКемВыдан</name>
    <comment>Организация, выдавшая документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <comment>Номер документа, удостоверяющего личность (для контрагентов - физических лиц)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПодчиненностиФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеОрганизации</name>
    <type>
      <types>CatalogRef.НаправленияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНалоговой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистрацииМРП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравоваяФорма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимНалогообложения</name>
    <type>
      <types>EnumRef.РежимыНалогообложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИностраннаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОКВЭД2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Учредители</name>
    <attributes>
      <name>Учредитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКонтактнойИнформации</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОсновныеБанковскиеСчета</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonForms/ЗагрузкаЗаявок/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	СоединениеАДО = ЗапросыЧерезАДО.ПолучитьСоединениеАДО("Fin_Request");
	
	Данные = ЗапросыЧерезАДО.ВыполнитьЗапросАДО(СоединениеАДО, СформироватьТекстЗапроса(ДатаНачала, ДатаОкончания));
	
	Если Данные <> Неопределено Тогда
		
		ТаблицаЗаявок.Очистить();
		
		МассивНовыхСтрок = Новый Массив;
		
		Для Каждого Элемент Из Данные Цикл
			
			//Если Элемент.i_status_id <> 3 Тогда
			//	Продолжить;
			//КонецЕсли;
			
			// Валюты
			Элемент.codeCurr = ?(Элемент.codeCurr = 810, 643, Элемент.codeCurr);
			Элемент.codeCurrPay = ?(Элемент.codeCurrPay = 810, 643, Элемент.codeCurrPay);
			
			НоваяСтрока = ТаблицаЗаявок.Добавить();
			
			МассивНовыхСтрок.Добавить(НоваяСтрока);
			
			НоваяСтрока.IDЗаявки = СокрЛП(Элемент.IDRequest);
			НоваяСтрока.ДатаЗаявки = Элемент.DateRequest;
			НоваяСтрока.ДатаОплаты = Элемент.DatePayDue;
			НоваяСтрока.НомерЗаявки = Элемент.NumberRequest;
			НоваяСтрока.Казначейство = Элемент.nomkazn;
			
			текНазнПлат = СокрЛП(Элемент.objPay);
			текДопИнфо = СокрЛП(Элемент.S_DOC_INFO); 
			текНазнПлат = текНазнПлат + ?(НЕ(текНазнПлат = "" И текДопИнфо = ""),"; ","") + текДопИнфо;
			
			НоваяСтрока.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", Элемент.OrgINN);
			НоваяСтрока.НазначениеПлатежа = текНазнПлат;
			НоваяСтрока.Сумма = Элемент.Amount;
			НоваяСтрока.СуммаНДС = Элемент.AmountNDS;
			НоваяСтрока.Валюта = Справочники.Валюты.НайтиПоКоду(СокрЛП(Элемент.codeCurr));
			НоваяСтрока.ВалютаОплаты = Справочники.Валюты.НайтиПоКоду(СокрЛП(Элемент.codeCurrPay));
			НоваяСтрока.КатегорияОперации = Справочники.КатегорииОпераций.НайтиПоКоду(СокрЛП(Элемент.codeKatOper));
			НоваяСтрока.Автор = СокрЛП(Элемент.Who);
			НоваяСтрока.ДолжностьАвтора = СокрЛП(Элемент.position);
			НоваяСтрока.Сводная = Булево(Элемент.hasChildren);
			НоваяСтрока.Процент = Элемент.percentPay;
			НоваяСтрока.КурсОплатыФиксированный	= Элемент.fixExchPay;
			НоваяСтрока.ЦФУ = Справочники.ЦФУ.НайтиПоКоду(СокрЛП(Элемент.codeCFU));
			НоваяСтрока.Бренд = Справочники.Брэнды.НайтиПоКоду(СокрЛП(Элемент.codeBrand));
			НоваяСтрока.ВзятаВРаботу = Элемент.i_status_id <> 3;
			НоваяСтрока.Комментарий = Элемент.comment;
			
			Если ЗначениеЗаполнено(Элемент.s_contractor_id) Тогда
				НоваяСтрока.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.s_contractor_id));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Элемент.s_contract_id) Тогда
				НоваяСтрока.Договор = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.s_contract_id));
			КонецЕсли;
			
			// Заполняем из Категории
			ДанныеУУ = УправленческийУчетСервер.ПодготовитьДанныеУправленческогоУчета(НоваяСтрока.КатегорияОперации);
			
			Для Каждого СтрокаПараметры Из ДанныеУУ Цикл
				
				НоваяСтрокаУУ = НоваяСтрока.ТаблицаУправленческогоУчета.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаУУ, СтрокаПараметры);
				
			КонецЦикла;
			
			//заполняем субконто
			Для т = 0 по 8 Цикл
				
				Параметр = Элемент["Параметр" + т];
				
				Если ЗначениеЗаполнено(Параметр) Тогда
					
					ФорматПараметра = Элемент["ФорматПараметра" + т];
					ЗначениеПараметра = Элемент["s_sub" + (т + 1)];
					
					СтрокиПоиска = НоваяСтрока.ТаблицаУправленческогоУчета.НайтиСтроки(Новый Структура("Имя", Параметр));
					Если СтрокиПоиска.Количество() > 0 Тогда
						
						СтрокаОбработки = СтрокиПоиска[0];
						Если СтрокаОбработки.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникЦФУ
							ИЛИ СтрокаОбработки.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникБрэнды Тогда
							
							Продолжить;
							
						ИначеЕсли СтрокаОбработки.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникКонтрагенты Тогда
							СтрокаОбработки.Значение = Справочники.Контрагенты.НайтиПоКоду(ЗначениеПараметра);
							
						ИначеЕсли СтрокаОбработки.ВидПараметра.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСубконтоУправленческогоУчета") Тогда
							СтрокаОбработки.Значение = Справочники.ЗначенияСубконтоУправленческогоУчета.НайтиПоКоду(ЗначениеПараметра,,, СтрокаОбработки.ВидПараметра);
							
						КонецЕсли;
						
					КонецЕсли;
					
					Для Каждого СтрокаУУ Из НоваяСтрока.ТаблицаУправленческогоУчета Цикл
						
						Если ТипЗнч(СтрокаУУ.ВидПараметра) = Тип("ПланВидовХарактеристикСсылка.РеквизитыУправленческогоУчета")
							И СтрокаУУ.ВидПараметра.НаименованиеПараметра = ФорматПараметра Тогда
							
							СтрокаУУ.Значение = Справочники.ЗначенияСубконтоУправленческогоУчета.НайтиПоКоду(ЗначениеПараметра,,, СтрокаУУ.ВидПараметра);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
			
			// Заполним ЦФУ и Брэнд
			СтрокиЦФУ = НоваяСтрока.ТаблицаУправленческогоУчета.НайтиСтроки(Новый Структура("Имя", "ЦФУ"));
			СтрокиБренд = НоваяСтрока.ТаблицаУправленческогоУчета.НайтиСтроки(Новый Структура("Имя", "Бренд"));
			СтрокиВалютнаяСумма = НоваяСтрока.ТаблицаУправленческогоУчета.НайтиСтроки(Новый Структура("Имя", "ВалютнаяСумма"));
			
			Если СтрокиЦФУ.Количество() > 0 Тогда
				СтрокиЦФУ[0].Значение = Справочники.ЦФУ.НайтиПоКоду(СокрЛП(Элемент.codeCFU));
			КонецЕсли;
			
			Если СтрокиБренд.Количество() > 0 Тогда
				СтрокиБренд[0].Значение = Справочники.Брэнды.НайтиПоКоду(СокрЛП(Элемент.codeBrand));
			КонецЕсли;
			
			Если СтрокиВалютнаяСумма.Количество() > 0 Тогда
				СтрокиВалютнаяСумма[0].Значение = НоваяСтрока.Сумма;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Поиск счетов по умолчанию
	ЗапросСчетовПоУмолчанию = Новый Запрос("ВЫБРАТЬ
	|	ОрганизацииОсновныеБанковскиеСчета.Ссылка КАК Организация,
	|	ОрганизацииОсновныеБанковскиеСчета.Валюта КАК Валюта,
	|	ОрганизацииОсновныеБанковскиеСчета.БанковскийСчет КАК СчетОрганизации
	|ИЗ
	|	Справочник.Организации.ОсновныеБанковскиеСчета КАК ОрганизацииОсновныеБанковскиеСчета
	|ГДЕ
	|	ОрганизацииОсновныеБанковскиеСчета.Ссылка В(&МассивОрганизаций)");
	
	ЗапросСчетовПоУмолчанию.УстановитьПараметр("МассивОрганизаций", ТаблицаЗаявок.Выгрузить(, "Организация").ВыгрузитьКолонку("Организация"));

	Выборка = ЗапросСчетовПоУмолчанию.Выполнить().Выбрать();
	
	Для Каждого СтрокаТЧ Из МассивНовыхСтрок Цикл
		
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Новый Структура("Организация, Валюта", СтрокаТЧ.Организация, ?(ЗначениеЗаполнено(СтрокаТЧ.ВалютаОплаты), СтрокаТЧ.ВалютаОплаты, Справочники.Валюты.РоссийскийРубль))) Тогда
			СтрокаТЧ.СчетОрганизации = Выборка.СчетОрганизации;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьТекстЗапроса(Дата1, Дата2)
	
	//Чернов
	ТекстЗапроса = "exec sp_get_requests_BUDGET_99
	| @d_begin 		= '" + ПреобразоватьДатуДляЗапросаSQL(НачалоДня(Дата1)) + "',
	| @d_end 		= '" + ПреобразоватьДатуДляЗапросаSQL(НачалоДня(Дата2) + 86400) + "',
	//| @s_division	= '" + СокрЛП(ФинПодразделение.Наименование) + "'";
	| @s_division	= 'All'";
	
	  
	Возврат ТекстЗапроса;

КонецФункции

Функция ПреобразоватьДатуДляЗапросаSQL(пДата) Экспорт	
	
	Если НЕ ЗначениеЗаполнено(пДата) Тогда
		Возврат NULL;
		
	Иначе
		Возврат Формат(Год(пДата), "ЧГ=0") + ?(Месяц(пДата) <= 9, "0", "") + Строка(Месяц(пДата)) + ?(День(пДата) <= 9, "0", "") + Строка(День(пДата));
		
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого СтрокаТЧ Из ТаблицаЗаявок Цикл
		СтрокаТЧ.Отметка = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиВсего(Команда)
	
	Для Каждого СтрокаТЧ Из ТаблицаЗаявок Цикл
		СтрокаТЧ.Отметка = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПеренестиЗавершение", ЭтотОбъект), "Перенести выбранные заявки?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Результат = Новый Массив;
		МассивНомеровЗаявок = Новый Массив;
		
		Для Каждого СтрокаТЧ Из ТаблицаЗаявок Цикл
			
			Если СтрокаТЧ.Отметка Тогда
				
				СтруктураВыгрузки = Новый Структура("Отметка, IDЗаявки, ДатаЗаявки, НомерЗаявки, КатегорияОперации, Сумма, СуммаНДС, Валюта, ВалютаОплаты, НазначениеПлатежа, ДолжностьАвтора, Автор, Сводная, Казначейство, Организация, СчетОрганизации, ДатаОплаты, ЦФУ, Бренд, Процент, КурсОплатыФиксированный, Комментарий, Контрагент, Договор");
				МассивНомеровЗаявок.Добавить(СтруктураВыгрузки);
				
				Для Каждого КлючЗначение Из СтруктураВыгрузки Цикл
					СтруктураВыгрузки.Вставить(КлючЗначение.Ключ, СтрокаТЧ[КлючЗначение.Ключ]);
				КонецЦикла;
				
				МассивСтрокУУ = Новый Массив;
				Для Каждого СтрокаТЧУУ Из СтрокаТЧ.ТаблицаУправленческогоУчета Цикл
					
					СтруктураВыгрузкиУУ = Новый Структура("Имя, Значение, ТипРеквизита, ЗапретРедактирования, Необязательный, ВидПараметра, Формула");
					
					Для Каждого КлючЗначение Из СтруктураВыгрузкиУУ Цикл
						СтруктураВыгрузкиУУ[КлючЗначение.Ключ] = СтрокаТЧУУ[КлючЗначение.Ключ];
					КонецЦикла;
					
					МассивСтрокУУ.Добавить(СтруктураВыгрузкиУУ);
					
				КонецЦикла;
				
				СтруктураВыгрузки.Вставить("ТаблицаУправленческогоУчета", МассивСтрокУУ);
				
			КонецЕсли;
			
		КонецЦикла;
		Закрыть(МассивНомеровЗаявок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюОЗаявках(МассивНомеровЗаявок)
	Возврат(РаботаСЗаявкамиКлиентСервер.ПолучитьИнформациюОЗаявкахПоМассивуЗаявок(МассивНомеровЗаявок));
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаДокумента") Тогда
		
		ДатаНачала = Параметры.ДатаДокумента;
		ДатаОкончания = Параметры.ДатаДокумента;
		ЗаполнитьНаСервере();
		
		НеОткрыватьДиалог = Истина;
		
	Иначе
		
		ДатаНачала = ДобавитьМесяц(ТекущаяДата(), -1);
		ДатаОкончания = ДобавитьМесяц(ТекущаяДата(), 1);
		ЗаполнитьНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НеОткрыватьДиалог Тогда
		
		Результат = Новый Массив;
		
		Для Каждого СтрокаТЧ Из ТаблицаЗаявок Цикл
			Результат.Добавить(Новый Структура("НомерЗаявки, IDЗаявки", СтрокаТЧ.НомерЗаявки, СтрокаТЧ.IDЗаявки));
		КонецЦикла;
		
		//Закрыть(Результат);
		
	КонецЕсли;
	
	УстановитьОтборСтрокВСписке();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаявокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьОтборСтрокВСписке();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВзятыеВРаботуПриИзменении(Элемент)
	УстановитьОтборСтрокВСписке();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрокВСписке()
	
	Если ПоказатьВзятыеВРаботу И ЗначениеЗаполнено(Организация) Тогда
		Элементы.ТаблицаЗаявок.ОтборСтрок = Новый ФиксированнаяСтруктура("Организация", Организация);
	ИначеЕсли НЕ ПоказатьВзятыеВРаботу И ЗначениеЗаполнено(Организация) Тогда
		Элементы.ТаблицаЗаявок.ОтборСтрок = Новый ФиксированнаяСтруктура("Организация, ВзятаВРаботу", Организация, Ложь);
	ИначеЕсли ПоказатьВзятыеВРаботу И НЕ ЗначениеЗаполнено(Организация) Тогда
		Элементы.ТаблицаЗаявок.ОтборСтрок = Неопределено;
	ИначеЕсли НЕ ПоказатьВзятыеВРаботу И НЕ ЗначениеЗаполнено(Организация) Тогда
		Элементы.ТаблицаЗаявок.ОтборСтрок = Новый ФиксированнаяСтруктура("ВзятаВРаботу", Ложь);
	КонецЕсли;
	
КонецПроцедуры
